Revit 2024 API
MacroManager.MacroLevel Property
 The Macro level.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public MacroLevel MacroLevel { get; }
Visual Basic
Public ReadOnly Property MacroLevel As MacroLevel
	Get
Visual C++
public:
property MacroLevel MacroLevel {
	MacroLevel get ();
}
See Also
MacroManager Class
Autodesk.Revit.DB.Macros Namespace